Solodros/ChibiOS-Contrib/os/hal/ports/AT32/AT32F40x/at32_registry.h
#define AT32_HAS_SPI3                       TRUE
#define AT32_SPI3_SUPPORTS_I2S              TRUE
#define AT32_SPI3_I2S_FULLDUPLEX            TRUE
#define AT32_SPI_SPI3_RX_DMA_STREAM         AT32_DMA_STREAM_ID(2, 1)
#define AT32_SPI_SPI3_TX_DMA_STREAM         AT32_DMA_STREAM_ID(2, 2)

#define AT32_HAS_SPI4                       TRUE
#define AT32_SPI4_SUPPORTS_I2S              TRUE
#define AT32_SPI4_I2S_FULLDUPLEX            FALSE
#define AT32_SPI_SPI4_RX_DMA_STREAM         AT32_DMA_STREAM_ID(2, 3)
#define AT32_SPI_SPI4_TX_DMA_STREAM         AT32_DMA_STREAM_ID(2, 4)

/* TIM attributes.*/
#define AT32_TIM_MAX_CHANNELS               4

#define AT32_HAS_TIM1                       TRUE
#define AT32_TIM1_IS_32BITS                 FALSE
#define AT32_TIM1_CHANNELS                  4

#define AT32_HAS_TIM2                       TRUE
#define AT32_TIM2_IS_32BITS                 TRUE
#define AT32_TIM2_CHANNELS                  4

#define AT32_HAS_TIM3                       TRUE
#define AT32_TIM3_IS_32BITS                 FALSE
#define AT32_TIM3_CHANNELS                  4

#define AT32_HAS_TIM4                       TRUE
#define AT32_TIM4_IS_32BITS                 FALSE
#define AT32_TIM4_CHANNELS                  4

#define AT32_HAS_TIM5                       TRUE
#define AT32_TIM5_IS_32BITS                 TRUE
#define AT32_TIM5_CHANNELS                  4

#define AT32_HAS_TIM6                       TRUE
#define AT32_TIM6_IS_32BITS                 FALSE
#define AT32_TIM6_CHANNELS                  0

#define AT32_HAS_TIM7                       TRUE
#define AT32_TIM7_IS_32BITS                 FALSE
#define AT32_TIM7_CHANNELS                  0

#define AT32_HAS_TIM8                       TRUE
#define AT32_TIM8_IS_32BITS                 FALSE
#define AT32_TIM8_CHANNELS                  4

#define AT32_HAS_TIM9                       TRUE
#define AT32_TIM9_IS_32BITS                 FALSE
#define AT32_TIM9_CHANNELS                  2

#define AT32_HAS_TIM10                      TRUE
#define AT32_TIM10_IS_32BITS                FALSE
#define AT32_TIM10_CHANNELS                 1

#define AT32_HAS_TIM11                      TRUE
#define AT32_TIM11_IS_32BITS                FALSE
#define AT32_TIM11_CHANNELS                 1

#define AT32_HAS_TIM12                      TRUE
#define AT32_TIM12_IS_32BITS                FALSE
#define AT32_TIM12_CHANNELS                 2

#define AT32_HAS_TIM13                      TRUE
#define AT32_TIM13_IS_32BITS                FALSE
#define AT32_TIM13_CHANNELS                 1

#define AT32_HAS_TIM14                      TRUE
#define AT32_TIM14_IS_32BITS                FALSE
#define AT32_TIM14_CHANNELS                 1

/* USART attributes.*/
#define AT32_HAS_USART1                    TRUE
#define AT32_UART_USART1_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 5)
#define AT32_UART_USART1_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 4)

#define AT32_HAS_USART2                    TRUE
#define AT32_UART_USART2_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 6)
#define AT32_UART_USART2_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 7)

#define AT32_HAS_USART3                    TRUE
#define AT32_UART_USART3_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 3)
#define AT32_UART_USART3_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 2)

#define AT32_HAS_UART4                     TRUE
#define AT32_UART_UART4_RX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 3)
#define AT32_UART_UART4_TX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 5)

#define AT32_HAS_UART5                     TRUE
#define AT32_HAS_USART6                    FALSE
#define AT32_HAS_UART7                     TRUE
#define AT32_HAS_UART8                     FALSE

/* USB attributes.*/
#define AT32_HAS_USB                       TRUE
#define AT32_USB_ACCESS_SCHEME_2x16        FALSE
#define AT32_USB_PMA_MAX_SIZE              1280
#define AT32_USB_HAS_BCDR                  FALSE
#define AT32_USB_HAS_CFG                   TRUE

/* IWDG attributes.*/
#define AT32_HAS_IWDG                      TRUE
#define AT32_IWDG_IS_WINDOWED              TRUE

/* FSMC attributes.*/
#define AT32_HAS_XMC                       TRUE

/* CRC attributes.*/
#define AT32_HAS_CRC                       TRUE
#define AT32_CRC_PROGRAMMABLE              FALSE

#endif /* defined(AT32F403ACx) */

#if defined(AT32F403ARx) || defined(__DOXYGEN__)
/**
 * @name    AT32F403ARx capabilities
 * @{
 */
/* ADC attributes.*/
#define AT32_HAS_ADC1                       TRUE
#define AT32_ADC1_DMA_MSK                   (AT32_DMA_STREAM_ID_MSK(1, 1))
#define AT32_ADC1_DMA_CHN                   0x00000000
#define AT32_HAS_ADC2                       TRUE
#define AT32_ADC2_DMA_MSK                   (AT32_DMA_STREAM_ID_MSK(1, 1))
#define AT32_ADC2_DMA_CHN                   0x00000000
#define AT32_HAS_ADC3                       TRUE
#define AT32_ADC3_DMA_MSK                   (AT32_DMA_STREAM_ID_MSK(2, 5))
#define AT32_ADC3_DMA_CHN                   0x00000000

/* CAN attributes.*/
#define AT32_HAS_CAN1                       TRUE
#define AT32_HAS_CAN2                       TRUE
#define AT32_CAN_MAX_FILTERS                14

/* DAC attributes.*/
#define AT32_HAS_DAC1_CH1                   TRUE
#define AT32_DAC_DAC1_CH1_DMA_STREAM        AT32_DMA_STREAM_ID(2, 3)
#define AT32_HAS_DAC1_CH2                   TRUE
#define AT32_DAC_DAC1_CH2_DMA_STREAM        AT32_DMA_STREAM_ID(2, 4)

/* GPIO attributes.*/
#define AT32_GPIO_HAS_HDRV                  TRUE

/* DMA attributes.*/
#define AT32_ADVANCED_DMA                   FALSE
#define AT32_DMA_SUPPORTS_DMAMUX            TRUE
#define AT32_DMA_SUPPORTS_CSELR             FALSE

#define AT32_DMA1_NUM_CHANNELS              7
#define AT32_DMA1_CH1_HANDLER               Vector6C
#define AT32_DMA1_CH2_HANDLER               Vector70
#define AT32_DMA1_CH3_HANDLER               Vector74
#define AT32_DMA1_CH4_HANDLER               Vector78
#define AT32_DMA1_CH5_HANDLER               Vector7C
#define AT32_DMA1_CH6_HANDLER               Vector80
#define AT32_DMA1_CH7_HANDLER               Vector84
#define AT32_DMA1_CH1_NUMBER                11
#define AT32_DMA1_CH2_NUMBER                12
#define AT32_DMA1_CH3_NUMBER                13
#define AT32_DMA1_CH4_NUMBER                14
#define AT32_DMA1_CH5_NUMBER                15
#define AT32_DMA1_CH6_NUMBER                16
#define AT32_DMA1_CH7_NUMBER                17

