Solodros/ChibiOS-Contrib/os/hal/ports/AT32/AT32F40x/at32_registry.h
#define AT32_DMA2_NUM_CHANNELS              7
#define AT32_DMA2_CH1_HANDLER               Vector120
#define AT32_DMA2_CH2_HANDLER               Vector124
#define AT32_DMA2_CH3_HANDLER               Vector128
#define AT32_DMA2_CH45_HANDLER              Vector12C
#define AT32_DMA2_CH67_HANDLER              Vector16C

#define AT32_DMA2_CH1_NUMBER                56
#define AT32_DMA2_CH2_NUMBER                57
#define AT32_DMA2_CH3_NUMBER                58
#define AT32_DMA2_CH45_NUMBER               59
#define AT32_DMA2_CH67_NUMBER               75

#define AT32_DMA2_CH4_NUMBER                AT32_DMA2_CH45_NUMBER
#define AT32_DMA2_CH5_NUMBER                AT32_DMA2_CH45_NUMBER
#define AT32_DMA2_CH6_NUMBER                AT32_DMA2_CH67_NUMBER 
#define AT32_DMA2_CH7_NUMBER                AT32_DMA2_CH67_NUMBER 

#define DMA2_CH4_CMASK                      0x00000C00U
#define DMA2_CH5_CMASK                      0x00000C00U
#define DMA2_CH6_CMASK                      0x00003000U
#define DMA2_CH7_CMASK                      0x00003000U

/* ETH attributes.*/
#define AT32_HAS_ETH                        FALSE

/* EXTI attributes.*/
#define AT32_EXTI_NUM_LINES                 20
#define AT32_EXTI_IMR_MASK                  0x00000000U

/* Flash attributes.*/
#if defined(AT32F40xxG)
#define AT32_FLASH_NUMBER_OF_BANKS          2
#else
#define AT32_FLASH_NUMBER_OF_BANKS          1
#endif

#define AT32_FLASH_SECTOR_SIZE              2048U

#if !defined(AT32_FLASH_SECTORS_PER_BANK) || defined(__DOXYGEN__)
#if defined(AT32F40xxG) || defined(AT32F40xxE)
#define AT32_FLASH_SECTORS_PER_BANK         256 /* Maximum, can be redefined.*/
#elif 
#define AT32_FLASH_SECTORS_PER_BANK         128 /* Maximum, can be redefined.*/
#endif
#endif

/* GPIO attributes.*/
#define AT32_HAS_GPIOA                      TRUE
#define AT32_HAS_GPIOB                      TRUE
#define AT32_HAS_GPIOC                      TRUE
#define AT32_HAS_GPIOD                      TRUE
#define AT32_HAS_GPIOE                      FALSE
#define AT32_HAS_GPIOF                      FALSE
#define AT32_HAS_GPIOG                      FALSE

/* I2C attributes.*/
#define AT32_HAS_I2C1                       TRUE
#define AT32_I2C_I2C1_RX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 7)
#define AT32_I2C_I2C1_TX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 6)

#define AT32_HAS_I2C2                       TRUE
#define AT32_I2C_I2C2_RX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 5)
#define AT32_I2C_I2C2_TX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 4)

#define AT32_HAS_I2C3                       TRUE
#define AT32_I2C_I2C3_RX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 3)
#define AT32_I2C_I2C3_TX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 2)

/* RTC attributes.*/
#define AT32_HAS_RTC                        TRUE
#define AT32_RTC_HAS_SUBSECONDS             FALSE
#define AT32_RTC_IS_CALENDAR                TRUE

/* SDIO attributes.*/
#define AT32_HAS_SDIO                       TRUE
#define AT32_SDC_SDIO_DMA_STREAM            AT32_DMA_STREAM_ID(2, 4)
#define AT32_HAS_SDIO2                      TRUE
#define AT32_SDC_SDIO2_DMA_STREAM           AT32_DMA_STREAM_ID(2, 5)

/* SPI attributes.*/
#define AT32_HAS_SPI1                       TRUE
#define AT32_SPI1_SUPPORTS_I2S              TRUE
#define AT32_SPI1_I2S_FULLDUPLEX            FALSE
#define AT32_SPI_SPI1_RX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 2)
#define AT32_SPI_SPI1_TX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 3)

#define AT32_HAS_SPI2                       TRUE
#define AT32_SPI2_SUPPORTS_I2S              TRUE
#define AT32_SPI2_I2S_FULLDUPLEX            TRUE
#define AT32_SPI_SPI2_RX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 4)
#define AT32_SPI_SPI2_TX_DMA_STREAM         AT32_DMA_STREAM_ID(1, 5)

#define AT32_HAS_SPI3                       TRUE
#define AT32_SPI3_SUPPORTS_I2S              TRUE
#define AT32_SPI3_I2S_FULLDUPLEX            TRUE
#define AT32_SPI_SPI3_RX_DMA_STREAM         AT32_DMA_STREAM_ID(2, 1)
#define AT32_SPI_SPI3_TX_DMA_STREAM         AT32_DMA_STREAM_ID(2, 2)

#define AT32_HAS_SPI4                       TRUE
#define AT32_SPI4_SUPPORTS_I2S              TRUE
#define AT32_SPI4_I2S_FULLDUPLEX            FALSE
#define AT32_SPI_SPI4_RX_DMA_STREAM         AT32_DMA_STREAM_ID(2, 3)
#define AT32_SPI_SPI4_TX_DMA_STREAM         AT32_DMA_STREAM_ID(2, 4)

/* TIM attributes.*/
#define AT32_TIM_MAX_CHANNELS               4

#define AT32_HAS_TIM1                       TRUE
#define AT32_TIM1_IS_32BITS                 FALSE
#define AT32_TIM1_CHANNELS                  4

#define AT32_HAS_TIM2                       TRUE
#define AT32_TIM2_IS_32BITS                 TRUE
#define AT32_TIM2_CHANNELS                  4

#define AT32_HAS_TIM3                       TRUE
#define AT32_TIM3_IS_32BITS                 FALSE
#define AT32_TIM3_CHANNELS                  4

#define AT32_HAS_TIM4                       TRUE
#define AT32_TIM4_IS_32BITS                 FALSE
#define AT32_TIM4_CHANNELS                  4

#define AT32_HAS_TIM5                       TRUE
#define AT32_TIM5_IS_32BITS                 TRUE
#define AT32_TIM5_CHANNELS                  4

#define AT32_HAS_TIM6                       TRUE
#define AT32_TIM6_IS_32BITS                 FALSE
#define AT32_TIM6_CHANNELS                  0

#define AT32_HAS_TIM7                       TRUE
#define AT32_TIM7_IS_32BITS                 FALSE
#define AT32_TIM7_CHANNELS                  0

#define AT32_HAS_TIM8                       TRUE
#define AT32_TIM8_IS_32BITS                 FALSE
#define AT32_TIM8_CHANNELS                  4

#define AT32_HAS_TIM9                       TRUE
#define AT32_TIM9_IS_32BITS                 FALSE
#define AT32_TIM9_CHANNELS                  2

#define AT32_HAS_TIM10                      TRUE
#define AT32_TIM10_IS_32BITS                FALSE
#define AT32_TIM10_CHANNELS                 1

#define AT32_HAS_TIM11                      TRUE
#define AT32_TIM11_IS_32BITS                FALSE
#define AT32_TIM11_CHANNELS                 1

#define AT32_HAS_TIM12                      TRUE
#define AT32_TIM12_IS_32BITS                FALSE
#define AT32_TIM12_CHANNELS                 2

#define AT32_HAS_TIM13                      TRUE
#define AT32_TIM13_IS_32BITS                FALSE
#define AT32_TIM13_CHANNELS                 1

#define AT32_HAS_TIM14                      TRUE
#define AT32_TIM14_IS_32BITS                FALSE
#define AT32_TIM14_CHANNELS                 1

/* USART attributes.*/
#define AT32_HAS_USART1                    TRUE
#define AT32_UART_USART1_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 5)
#define AT32_UART_USART1_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 4)

