Solodros/ChibiOS-Contrib/os/hal/ports/AT32/AT32F40x/at32_registry.h
#define AT32_HAS_TIM6                       TRUE
#define AT32_TIM6_IS_32BITS                 FALSE
#define AT32_TIM6_CHANNELS                  0

#define AT32_HAS_TIM7                       TRUE
#define AT32_TIM7_IS_32BITS                 FALSE
#define AT32_TIM7_CHANNELS                  0

#define AT32_HAS_TIM8                       TRUE
#define AT32_TIM8_IS_32BITS                 FALSE
#define AT32_TIM8_CHANNELS                  4

#define AT32_HAS_TIM9                       TRUE
#define AT32_TIM9_IS_32BITS                 FALSE
#define AT32_TIM9_CHANNELS                  2

#define AT32_HAS_TIM10                      TRUE
#define AT32_TIM10_IS_32BITS                FALSE
#define AT32_TIM10_CHANNELS                 1

#define AT32_HAS_TIM11                      TRUE
#define AT32_TIM11_IS_32BITS                FALSE
#define AT32_TIM11_CHANNELS                 1

#define AT32_HAS_TIM12                      TRUE
#define AT32_TIM12_IS_32BITS                FALSE
#define AT32_TIM12_CHANNELS                 2

#define AT32_HAS_TIM13                      TRUE
#define AT32_TIM13_IS_32BITS                FALSE
#define AT32_TIM13_CHANNELS                 1

#define AT32_HAS_TIM14                      TRUE
#define AT32_TIM14_IS_32BITS                FALSE
#define AT32_TIM14_CHANNELS                 1

/* USART attributes.*/
#define AT32_HAS_USART1                    TRUE
#define AT32_UART_USART1_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 5)
#define AT32_UART_USART1_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 4)

#define AT32_HAS_USART2                    TRUE
#define AT32_UART_USART2_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 6)
#define AT32_UART_USART2_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 7)

#define AT32_HAS_USART3                    TRUE
#define AT32_UART_USART3_RX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 3)
#define AT32_UART_USART3_TX_DMA_STREAM     AT32_DMA_STREAM_ID(1, 2)

#define AT32_HAS_UART4                     TRUE
#define AT32_UART_UART4_RX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 3)
#define AT32_UART_UART4_TX_DMA_STREAM      AT32_DMA_STREAM_ID(2, 5)

#define AT32_HAS_UART5                     TRUE
#define AT32_HAS_USART6                    TRUE
#define AT32_HAS_UART7                     TRUE
#define AT32_HAS_UART8                     TRUE

/* USB attributes.*/
#define AT32_HAS_USB                       TRUE
#define AT32_USB_ACCESS_SCHEME_2x16        FALSE
#define AT32_USB_PMA_MAX_SIZE              1280
#define AT32_USB_HAS_BCDR                  FALSE
#define AT32_USB_HAS_CFG                   TRUE

/* IWDG attributes.*/
#define AT32_HAS_IWDG                      TRUE
#define AT32_IWDG_IS_WINDOWED              TRUE

/* FSMC attributes.*/
#define AT32_HAS_XMC                       TRUE

/* CRC attributes.*/
#define AT32_HAS_CRC                       TRUE
#define AT32_CRC_PROGRAMMABLE              FALSE

#endif /* defined(AT32F407Rx) || defined(AT32F407Vx) */
#endif /* AT32_REGISTRY_H */

/** @} */
